HARTL/sample_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "microposts".* FROM "microposts"  WHERE "microposts"."user_id" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts"  WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
	def show
		@user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])