HARTL/sample_app/app/views/users/show.html.erb

SELECT  1 AS one FROM "microposts"  WHERE "microposts"."user_id" = ? LIMIT 1  [["user_id", 1]]
---

		<% if @user.microposts.any? %>